# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationTypeSet..::..Insert Method
InsulationTypeSet Class See Also
---
Insert the specified insulation type into the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	InsulationType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As InsulationType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	InsulationType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..InsulationTypeThe insulation type to be inserted into the set.
# ### Return Value
Returns whether the insulation type was inserted into the set.
# See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace